# Задача 2. При анализиране на данни, събрани като част от научен експеримент, може
# да се наложи да се премахнат най-крайните (големите) стойности, преди да се
# извършват някакви други изчисления. Да се създаде списък от стойностите само с n на
# брой положителни числа. Трябва да се създаде ново копие на създаденият списък с
# премахнатите n най-големи елемента и n най-малките елементи. Редът на елементите
# във върнатия списък не трябва да съвпада с реда на елементите в първоначалния
# списък. Напишете програма, която да чете списък от числа въведени от потребителя и
# да премахва двете най-големи и двете най-малки стойности. Да се принтира новият
# списък, както и оригиналният. Програма трябва да генерира подходящо съобщение за
# # грешка, ако потребителят въведе по-малко от 4 стойности.
#


numbers = input('Enter at least 5 number in format 1, 2, 3, 4, 5: ').replace(' ', '').split(', ')
numbers = [int(number) for number in numbers]

if len(numbers) > 4:
    new_numbers = numbers.copy()
    new_numbers.sort()
    new_numbers.pop(0)
    new_numbers.pop(0)
    new_numbers.pop()
    new_numbers.pop()

    print(numbers)
    print(new_numbers)

else:
    print('Enter at least 5 numbers')


# # filtered_number = numbers.copy()
#
# numbers = []
#
# for i in range(0 ,5):
#     numbers.append(int(input()))
#
# print(numbers)


