import math
from unittest import result
# # Задача 10. Да се напише програма, която да пресмята лицето на кръг при зададен радиус r.

# print(math.pi)
# r = 5

# circle_face =  math.pi * (r ** 2)
# print(circle_face)


# TODO: link to math formulae
# Задача 8. Напишете програма, която за дадени дължина и височина на успоредник, пресмята и отпечатва на конзолата неговия периметър и лице.

# b = 10
# h = 7

# face = b*h
# print(face)


# # Задача 11. Да се напише програма, която пресмята от inches в centimeters. Един inches е 2.54 centimeters.
# x_in_inche = 10
# x_in_cm = x_in_inche * 2.54

# print(x_in_cm)



# Задача 7. Декларирайте две променливи, които да са цели числа. Задайте им стойности съответно 5 и 10. Разменете стойностите им и ги отпечатайте.


# x = 5
# y = 10

# print(x,y) # 5, 10

# # Variant 1: with tmp variable
# # temp = x
# # x = y
# # y = temp

# # Variant 2: with tuples
# # x,y = y,x

# print(x,y) # 10 5


# Задача 4. Да се присвои стойност 3 на променлива ‘x’ и стойност 10 на променлива наречена ‘y’. Да се запази стойността от x + y в отделна променлива, която да се казва ‘result’. Накрая изходната информация трябва да изглежда:
# 	 3+10 = 13


# x = 3
# y = 10

# result = x*y
# print('3+10=',result, sep="")
