# ---------------------------------- Task 1 ---------------------------------- #
# Да се състави програма, чрез която се въвежда 4-цифренo естествено число от интервала [1000.. 9999]. От това число се формират 2 нови 2-цифрени числа.
# Първото число се формира от 1-та и 4-та цифра на въведеното число. Второто число се формира от 2-рa - 3-та цифра на въведеното число. На екрана да се изведе дали 1-то ново число e по-малко <, равно = или по-голямо от 2-то число.
# Използвайте проверка на логическо условие - оператор if.
# Пример: 3332 Изход: по-малко (32<33)
# Пример: 1144 Изход: равни (14=14)
# Пример: 9875 Изход: по-голямо (95>87)



try:
    # x = input('x:')
    x = '3332'
    first = int(x[0] + x[3])
    second = int(x[1] + x[2])
    x = int(x)

    if not 1000<=x<=9999:
        print('Enter a 4 digit number')
        exit()

    print('YOUR CODE HERE')
except:
    print('Enter a number')

